#ifndef CONFIG_H
#define CONFIG_H

namespace MCU{

//--------------------------------------------------------------------------//
//                       Порты (ножки) микроконтроллера                     //
//--------------------------------------------------------------------------//
// Ножки RGB-светодиодов
#define SENSOR1_LED_RED_PIN   14
#define SENSOR1_LED_GREEN_PIN 17
#define SENSOR1_LED_BLUE_PIN  18

#define SENSOR2_LED_RED_PIN    2
#define SENSOR2_LED_GREEN_PIN  3
#define SENSOR2_LED_BLUE_PIN  11

#define MAIN_LED_RED_PIN   7
#define MAIN_LED_GREEN_PIN 6
#define MAIN_LED_BLUE_PIN  0 // Нет ноги

//--------------------------------------------------------------------------//
//                                 Выход на реле                            //
//--------------------------------------------------------------------------//
#define RELAY_OUT_PIN 10
#define RELAY_HYSTERESIS 1000 // 1 секунда
//--------------------------------------------------------------------------//
//                               Вход герконов                              //
//--------------------------------------------------------------------------//
#define SENSOR1_PIN 9
#define SENSOR2_PIN 8

//--------------------------------------------------------------------------//
//                                   Кнопки                                 //
//--------------------------------------------------------------------------//
#define BUTTON1_PIN 12
#define BUTTON2_PIN 13

//--------------------------------------------------------------------------//
//         Тайминги, для обработки аппаратных устройств (мкСек)             //
//--------------------------------------------------------------------------//
#define MAIN_TIMER 1000 // Период (мкСек) основного таймера устройства

// Все остальные тийминги будут опираться на MAIN_TIMER (делиться на него)
#define RGB_LED_TIMER 1000 // Период обработки RGB светодиода (частота 1кГц)
static_assert(RGB_LED_TIMER % MAIN_TIMER==0,"Должно кратно делиться на MAIN_TIMER");

#define MAIN_LOOP_PERIOD   10000 // Переодичность основного цикла. Думаю 100 раз в секунду - достаточно.
static_assert(MAIN_LOOP_PERIOD % MAIN_TIMER==0,"Должно кратно делиться на MAIN_TIMER");

#define SENSORS_PERIOD   10000 // Переодичность опроса сенсоров. Думаю 100 раз в секунду - достаточно.
static_assert(MAIN_LOOP_PERIOD % MAIN_TIMER==0,"Должно кратно делиться на MAIN_TIMER");

#define BUTTONS_PERIOD   10000 // Переодичность опроса кнопок. Думаю 100 раз в секунду - достаточно.
static_assert(MAIN_LOOP_PERIOD % MAIN_TIMER==0,"Должно кратно делиться на MAIN_TIMER");

#define RELAY_PERIOD     1000 // Переодичность опроса реле. 1мсек, чтобы гистерезис отрабатывать.
static_assert(MAIN_LOOP_PERIOD % MAIN_TIMER==0,"Должно кратно делиться на MAIN_TIMER");

}//namespace MCU

#endif // CONFIG_H
