#ifndef HW_SPECIFIC_H
#define HW_SPECIFIC_H
#include <stdint.h>

namespace MCU{

enum EPortState{
    On=0,
    Off,
};

extern EPortState operator!(EPortState oth);

}//namespace MCU

/*! \todo Все функции объявленный в этом файле надо прописать в соответствующем
 * cpp для используемого контроллера и платы.
 */
//============================================================================//
//                        Общая настройка оборудования                        //
//============================================================================//
/*!
 * \brief Инициализация микроконтроллера....
 */
extern void HW_MkInit();

//============================================================================//
//                              Цифровые порты                                //
//============================================================================//
/*!
 * \brief Настроить соответствующий вывод порта
 * \param bit    вывод порта
 * \param config конфигурация вывода порта
 * \return \b true если всё прошло успешно, иначе \b false
 */
extern bool HW_InitPortBit (int bit,int config,int pull);

/*!
 * \brief Установить выход порта в 1
 * \param bit    вывод порта
 */
extern void HW_SetPortBit  (int bit);

/*!
 * \brief Установить выход порта в 0
 * \param bit    вывод порта
 */
extern void HW_ResetPortBit(int bit);

/*!
 * \brief Прочитать состояние порта
 * \param bit    вывод порта
 */
extern MCU::EPortState HW_GetPortBit(int bit);

// ------------------------- Конфигурация портов ---------------------------- //
#define PORT_INPUT      0 // Вход
#define PORT_OUTPUT_PP  1 // Выход (и верхний и нижний транзисторы включены)
#define PORT_OUTPUT_OD  2 // Выход (открытый коллектор)
#define PORT_ALTERNATE  3 // 10: Alternate function mode
#define PORT_ANALOG     4 // 11: Analog mode


#define PORT_NO_PULL    0b00 // Подтяжка вверх
#define PORT_PULL_UP    0b01 // Подтяжка вверх
#define PORT_PULL_DOWN  0b10 // Подтяжка вноз

//============================================================================//
//                                Системый таймер                             //
//============================================================================//
/*!
 * \brief Счетчик стабатывания прерывания по таймера. Процедура прерывания
 * должна инкременировать эту переменную
 */
extern int HW_MainSystemTimerFlag;

/*!
 * \brief Инициализация основного системного таймера
 * \return \b true если всё прошло успешно, иначе \b false
 */
extern bool HW_TimerInit ();

//============================================================================//
//                                Таймер пищалки                              //
//============================================================================//


#endif //HW_SPECIFIC_H
